antiX19/Projet_IT2R_1_ER/LPC1768_Main_Controlle/main.c
/*----------------------------------------------------------------------------
 * CMSIS-RTOS 'main' function template
 *---------------------------------------------------------------------------*/

#define osObjectsPublic                     // define objects in main module
#include "osObjects.h"                      // RTOS object definitions
#include "Driver_USART.h"               // ::CMSIS Driver:USART
#include "Board_GLCD.h"                 // ::Board Support:Graphic LCD
#include "GLCD_Config.h"                // Keil.MCB1700::Board Support:Graphic LCD
#include "stdio.h"
#include "GPIO_LPC17xx.h"               // Keil::Device:GPIO
#include "PIN_LPC17xx.h"                // Keil::Device:PIN
#include "cmsis_os.h"                   // ARM::CMSIS:RTOS:Keil RTX
#include "LPC17xx.h"                    // Device header



extern ARM_DRIVER_USART Driver_USART1;
extern GLCD_FONT GLCD_Font_6x8;
extern GLCD_FONT GLCD_Font_16x24;


void Init_UART(void);
void receptionBT (void const* argument);
void PWM_Servo (void const * argument);
void Pilotage (void const* argument);
void initPwm(void);
void TIMER0_IRQHandler(void);
void Init_TIM0(void);
void MoteurAV(uint32_t vitesse);
void MoteurAR(uint32_t vitesse);


//VAL MIN = 3060
//VAL MOY = 4172
//VAL mAX = 5285
uint8_t tab[3];
uint32_t temps_haut = 3100;
uint32_t temps_tot = 55600;



osThreadId  ID_receptionBT,ID_Pilotage,ID_test;



osThreadDef (receptionBT, osPriorityNormal, 1, 0);
osThreadDef (Pilotage , osPriorityNormal, 1, 0);








int main (void) {
  osKernelInitialize ();                    // initialize CMSIS-RTOS
	GLCD_Initialize();
	GLCD_ClearScreen();
	GLCD_SetFont(&GLCD_Font_16x24);
	Init_UART();
	initPwm();
	Init_TIM0();
	
	

	
	MoteurAV(20);
	
	LPC_GPIO1->FIODIR3 &= 0xFA;
	
	LPC_GPIO0->FIODIR2 = LPC_GPIO0->FIODIR2 | 0x0F; 

	ID_receptionBT=osThreadCreate (osThread (receptionBT), NULL);
	//ID_Pilotage=osThreadCreate (osThread (Pilotage), NULL);

	
	
  osKernelStart ();                         // start thread execution 

	
	
	
	osDelay(osWaitForever);
}









void receptionBT (void const* argument){
	char text[50];


	
	
	while(1) {		

		
		while(Driver_USART1.GetStatus().tx_busy == 1); // attente buffer TX vide
		Driver_USART1.Receive(tab,3);
		
		
		GLCD_DrawString(1,1*24, "Reception :           ");
		sprintf(text,"valeurs: X=%2x, Y=%2x", tab[0], tab[1]);
		GLCD_DrawString(1,2*24, text);
		sprintf(text,"valeurs: Z = %2x", tab[2]);
		GLCD_DrawString(1,3*24, text);
		//osSignalSet(ID_Pilotage,0x0001);
		
	}
}




void Pilotage (void const* argument){


	
	
	while(1){
		
		osSignalWait(0x0001,osWaitForever);
	

		
		
		osSignalSet(ID_receptionBT,0x0002);
		
	}
	
}











void initPwm(void){ 
	
	// initialisation de timer 1
		
	LPC_SC->PCONP = LPC_SC->PCONP | 0x00000040; // enable PWM1

	// TC s'incrémente toutes les 480 ns
	LPC_PWM1->PR = 0; // prescaler

	LPC_PWM1->MR0 =1259; // Ceci ajuste la période de la PWM à 40 us
		

		
	// P3.26 est la sortie PWM Channel 3 de Timer 1
	LPC_PINCON->PINSEL7 = LPC_PINCON->PINSEL7 | 0x000C0000;
	LPC_PWM1->MCR = LPC_PWM1->MCR |0x00000002; // Timer relancé quand MR0 repasse à 0
	// ceci donne le droit de modifier dynamiquement la valeur du rapport cyclique
	LPC_PWM1->LER = LPC_PWM1->LER | 0x00000009;
	LPC_PWM1->PCR = LPC_PWM1->PCR | 0x00000e00; // autorise la sortie PWM
	LPC_PWM1->TCR = 1; /*validation de timer 1 et reset counter */
}


void Init_UART(void){
	Driver_USART1.Initialize(NULL);
	Driver_USART1.PowerControl(ARM_POWER_FULL);
	Driver_USART1.Control(	ARM_USART_MODE_ASYNCHRONOUS |
							ARM_USART_DATA_BITS_8		|
							ARM_USART_STOP_BITS_1		|
							ARM_USART_PARITY_NONE		|
							ARM_USART_FLOW_CONTROL_NONE,
							115200);
	Driver_USART1.Control(ARM_USART_CONTROL_TX,1);
	Driver_USART1.Control(ARM_USART_CONTROL_RX,1);
}

void Init_TIM0(void){
	LPC_GPIO3->FIODIR3 = 	LPC_GPIO3->FIODIR3 | 0x04;
	LPC_GPIO3->FIOPIN3 |= 0x04;

	LPC_SC->PCONP = LPC_SC->PCONP | 0x000000006;  //Enable TIM0
	LPC_TIM0->PR = 8;
	LPC_TIM0->MR0 = temps_haut;
	LPC_TIM0->MCR = LPC_TIM0->MCR | 0x00000003; //réglage RAZ
	LPC_TIM0->TCR = 1 ;
	
	NVIC_SetPriority(TIMER0_IRQn,0);
	NVIC_EnableIRQ(TIMER0_IRQn);
}



void TIMER0_IRQHandler(void){

	 
	int val_compt = LPC_TIM0->MR0;
	LPC_TIM0->IR = LPC_TIM0->IR  | (1<<0);
	LPC_GPIO3->FIOPIN3 = LPC_GPIO3->FIOPIN3 ^ 0x04; //inverse l'état de P3,5
	 
	 if(LPC_TIM0->MR0 == temps_haut){
		 LPC_TIM0->MR0 = (temps_tot-temps_haut);
	 }
	 else if(LPC_TIM0->MR0 != temps_haut){
		 LPC_TIM0->MR0 = temps_haut;
	 }
	 
 }

 
 
void MoteurAV(uint32_t vitesse)
{
	uint32_t vit=0;
	//LPC_GPIO0->FIOPIN2 = LPC_GPIO0->FIOPIN2 & 0xFC; // mets INA à 0
	LPC_GPIO0->FIOPIN2 = 0x0D; // mets INA à 0
	vit = vitesse *10;
	LPC_PWM1->MR2 = 100;
	LPC_PWM1->MR2 = vit;// ceci ajuste la duree de l'état haut

	
}

void MoteurAR(uint32_t vitesse)
{
	uint32_t vit=0;
	//LPC_GPIO0->FIOPIN2 = LPC_GPIO0->FIOPIN2 & 0xFC; // mets INA à 0
	LPC_GPIO0->FIOPIN2 = 0x0E; // mets INA à 0
	
	vit = vitesse *10;
	LPC_PWM1->MR2 = 100;
	LPC_PWM1->MR2 = vit;// ceci ajuste la duree de l'état haut

	
}
